#Задача 10
#На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
#Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной.
#Выведите минимальное количество монет, которые нужно перевернуть.
#Пример:
#5 -> 1 0 1 1 0
#2
from random import randint

coins_num = int(input("Введите количество монеток на столе: "))

orel, rezhka = 0, 0

for i in range (coins_num):
    type = randint(0, 1)
    print (type, end = ' ')

    if type == 0:
         orel += 1
    else:
        rezhka += 1

print (f"Ваш список:{coins_num} ")

if orel > rezhka:
    print (f"Мимимальное количество переворотов - {rezhka}")
else:
    print (f"Мимимальное количество переворотов - {orel}")

print (orel)
print (rezhka)