#Задача 12
#Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
#Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки.
#Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.
#Пример:
#4 4 -> 2 2
#5 6 -> 2 3

y = int(input("Петя, введи первое число от 0 до 1000: "))
x = int(input("Петя, введи второе число от 0 до 1000: "))

print()

k1 = int(input("Катя, назови первое число от 0 до 1000:  "))
k2 = int(input("Катя, назови второе число от 0 до 1000:  "))

print()

if k1 == y and k2 == x:
    print("Катя, ты умница! Все угадала")

elif k1 != y and k2 == x:
    print("Катя, первое число неправильное")
    print(f"Подсказка: Сумма чисел равна {x+y} , а произведение {x*y}")

elif k1 == y and k2 != x:
    print("Катя, второе число неправильное")
    print(f"Подсказка: Сумма чисел равна {x+y} , а произведение {x*y}")

else:
    print("Катя, оба числа неверны")
    print(f"Подсказка: Сумма чисел равна {x+y} , а произведение {x*y}")
