#Задача 14
#Требуется вывести все целые степени двойки (т.е. числа вида 2**k), не превосходящие числа N.
#Пример:
#10 -> 1 2 4 8

num = int(input("Введите число, до которого будут выводиться степени числа 2: "))

result = 2
while result <= num:
    print (result)
    result = result * 2
    